# Basics of Pandas
Pandas is strong data analyzing tool, more of imagine it as group of excel sheets.
* series
* dataframes
* missing values
* merge, join and concatenate
* operations
* i/p and o/p

In [3]:
import numpy as np
import pandas as pd

## Series

In [5]:
# series
s1 = ['a', 'b', 'b']
s2 = [0, 1, 2]
s3 = np.array([1, 2, 3])

In [8]:
pd.Series(data = s2)

0    0
1    1
2    2
dtype: int64

In [10]:
pd.Series(s2, s1)

a    0
b    1
b    2
dtype: int64

In [12]:
pd.Series(s3, s1)

a    1
b    2
b    3
dtype: int32

In [18]:
s4 = {'a' : 1, 'b' : 2, 'c' : 3}
pd.Series(s4)

a    1
b    2
c    3
dtype: int64

In [21]:
s1 = pd.Series([1,2,3], index = ['India', 'USA', 'Australia'])
s1

India        1
USA          2
Australia    3
dtype: int64

In [25]:
s1['India']

1

In [27]:
s2 = pd.Series([2,3,4], index = ['USA', "Australia", "England"])
s1 + s2

Australia    6.0
England      NaN
India        NaN
USA          4.0
dtype: float64

## DataFrames

In [33]:
from numpy.random import randn
# np.random.seed(101)

In [39]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [40]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [43]:
df[['W', 'Z']]

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [45]:
type(df['W'])

pandas.core.series.Series

In [48]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [50]:
df.drop('new', axis=1)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [52]:
df

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [59]:
df.drop('E', axis=0)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [61]:
df.iloc[2]

W    0.666319
X   -0.538235
Y   -0.568581
Z    1.407338
Name: C, dtype: float64

In [64]:
df.loc['B', 'Y']

-0.8551960407780934

In [66]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.467514 -0.162535
B  0.392489 -0.855196

In [68]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [70]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True   True  False   True
C   True  False  False   True
D   True  False  False   True
E  False  False   True  False

In [72]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.485809
B  0.392489  0.221491       NaN  1.541990
C  0.666319       NaN       NaN  1.407338
D  0.641806       NaN       NaN  1.028293
E       NaN       NaN  0.720788       NaN

In [73]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [75]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [76]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [80]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [82]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

In [87]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.080471  0.902398
   2  0.161781  0.833029
   3  0.975720 -0.388239
G2 1  0.783316 -0.708954
   2  0.586847 -1.621348
   3  0.677535  0.026105

In [92]:
print(df.loc['G1'])
print('\n')
print(df.loc['G1'].loc[1])

          A         B
1 -1.080471  0.902398
2  0.161781  0.833029
3  0.975720 -0.388239


A   -1.080471
B    0.902398
Name: 1, dtype: float64

In [96]:
df.index.names = ['Group', 'Num']
df

                  A         B
Group Num
G1    1   -1.080471  0.902398
      2    0.161781  0.833029
      3    0.975720 -0.388239
G2    1    0.783316 -0.708954
      2    0.586847 -1.621348
      3    0.677535  0.026105

In [97]:
df.xs(['G1',1])

C:\Users\Hayan\AppData\Local\Temp\ipykernel_23564\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -1.080471
B    0.902398
Name: (G1, 1), dtype: float64

In [98]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.080471  0.902398
G2     0.783316 -0.708954